app/controllers/admins_controller.rb

	def index
		if current_user.is_admin?
			@users = User.all
---
SELECT "users".* FROM "users"

	def admin_user
		u = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def unadmin_user
		u = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]