app/controllers/escapes_controller.rb

SELECT "escapes".* FROM "escapes"
---
    def index
        @all = Escape.all

SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        id = params[:id]
        if Escape.exists?(id)
            @escape = Escape.find(id)

INSERT INTO "escapes" ("Luogo", "Stanza", "Descrizione", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Luogo", "Porva oggi"], ["Stanza", "proga ogg"], ["Descrizione", ""], ["created_at", "2021-05-22 22:02:00.271268"], ["updated_at", "2021-05-22 22:02:00.271268"]]
---
    def create
        authorize! :create, Review, message: "Non sei autorizzato"
        @escape = Escape.new(escape_params)
        if @escape.save

SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "escapes" WHERE "escapes"."id" = ?  [["id", 1]]
---
    def destroy
        authorize! :destroy, Review, message: "Non sei autorizzato"
        @escape = Escape.find(params[:id])
        @escape.destroy

SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
      def edit
        @escape = Escape.find(params[:id])

SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "escapes" SET "Descrizione" = ?, "updated_at" = ? WHERE "escapes"."id" = ?  [["Descrizione", "https://roma.escapegameover.it/rooms/pirates-of-caribbean.php"], ["updated_at", "2021-05-28 15:36:18.001729"], ["id", 8]]
---
      def update
        @escape = Escape.find(params[:id])
        if @escape.update(escape_params)