app/controllers/reviews_controller.rb

  def create
    @escape = Escape.find(params[:escape_id])


    @review = @escape.reviews.create(review_params)
---
SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("valutazione", "difficoltà", "testo_recensione", "escape_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @escape = Escape.find(params[:escape_id])
    @review = @escape.reviews.find(params[:id])
    @review.destroy
---
SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."escape_id" = ? AND "reviews"."id" = ? LIMIT ?  [["escape_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]

    def user_reviews
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]