app/models/escape.rb

  def mediaVoti
    total1 = 0
    self.reviews.each do |rev|
      total1 += rev.voto
    end
    return (total1.to_f/self.reviews.count.to_f).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."escape_id" = ?  [["escape_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."escape_id" = ?  [["escape_id", 1]]

  def mediaDiff
    total2 = 0
    self.reviews.each do |rev|
      total2 += rev.difficoltà
    end
    return (total2.to_f/self.reviews.count.to_f).round(2)
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."escape_id" = ?  [["escape_id", 1]]