app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "vitulli430@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
   def self.from_omniauth(access_token)
    	data = access_token.info

    	user = User.where(email: data['email']).first
		# Uncomment the section below if you want users to be created if they don't exist
	     unless user
	         user = User.create( email: data['email'],
	            password: Devise.friendly_token[0,20]
	         )

UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-05-22 11:37:23.484350"], ["roles_mask", 1], ["id", 1]]
---
	def set_admin
		self.roles_mask = (self.roles_mask | 1)
		self.save

UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-05-22 11:37:25.080131"], ["roles_mask", 0], ["id", 1]]
---
	def unset_admin
		self.roles_mask = 0
		self.save