app/views/escapes/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."escape_id" = ?  [["escape_id", 5]]
---
      <div class="row">
        <% @escape.reviews.each do |rec| %>