app/views/reviews/user_reviews.html.erb

  <h2>Recensioni</h2>
  <% if @user.reviews.empty? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

    </thead>
    <% @user.reviews.each do |rec| %>
    <tr>
    <td><%= link_to Escape.find(rec.escape_id).Stanza,escape_path(rec.escape_id)%></td>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT "escapes".* FROM "escapes" WHERE "escapes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]